# ServerId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkConversionData..::..ServerId Property
LinkConversionData Class See Also
---
The service responsible for converting the data into a Revit file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public Guid ServerId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ServerId As Guid
	Get
```

Visual C++
---
```text
public:
property Guid ServerId {
	Guid get ();
}
```

# See Also
LinkConversionData Class
Autodesk.Revit.DB Namespace